# Задание 1. Задано целое число. Проверить, парное ли оно.
# Число называется четным, если оно делится на 2 нацело.

a = int(input('Введите число: '))
if a % 2 == 0:
    print('Число четное')
else:
    print('Число не четное')



